Video 4

# Reading,Writing CSV and EXCEL files

Topics Covered


1.Read CSV
2.Write CSV
3.Read Excel
4.Write Excel

In [2]:
import pandas as pd

CSV

In [3]:
df=pd.read_csv("stock_data.csv")

In [4]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [ ]:
#skip rows argument to skip rows form top

reading limited data

In [3]:
df=pd.read_csv("stock_data.csv",nrows=3)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [5]:

df=pd.read_csv("stock_data.csv",na_values=["not available","nan"])
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65           n.a.
2    MSFT  -1.00       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

supply dict for replace with 'na_values'

In [6]:
df.to_csv('new.csv') #create csv of name NEW

In [ ]:
df.to_csv("new.csv")

In [ ]:
# refer this Video for the rest of the part